jMeter/messages/REQ17_ParseLatitudes.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:ParseLatitudes xmlns:ns1="urn:us:gov:ic:ism:v2" xmlns:ns3="mil:nga:coordinate_parse"><security ns1:ownerProducer="USA" ns1:classification="U"/><latitudes>543423.123S</latitudes><latitudes>222222.123S</latitudes></ns3:ParseLatitudes></S:Body></S:Envelope>