jMeter/messages/REQ11_ParseCoordPair.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:ParseCoordPair xmlns:ns1="urn:us:gov:ic:ism:v2" xmlns:ns3="mil:nga:coordinate_parse"><security ns1:ownerProducer="USA" ns1:classification="U"/><coordinatePairString><latitude>543423.123S</latitude><longitude>1125433.234W</longitude></coordinatePairString></ns3:ParseCoordPair></S:Body></S:Envelope>