jMeter/messages/REQ9_GetErrorMessage.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:GetErrorMessage xmlns:ns1="urn:us:gov:ic:ism:v2" xmlns:ns3="mil:nga:coordinate_parse"><security ns1:ownerProducer="USA" ns1:classification="U"/><errorNum>-1001.0</errorNum></ns3:GetErrorMessage></S:Body></S:Envelope>