jMeter/messages/REQ19_ParseLongitude.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:ParseLongitude xmlns:ns1="urn:us:gov:ic:ism:v2" xmlns:ns3="mil:nga:coordinate_parse"><security ns1:ownerProducer="USA" ns1:classification="U"/><longitude>543423.123W</longitude></ns3:ParseLongitude></S:Body></S:Envelope>
