jMeter/messages/REQ15_ParseLatitude.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns3:ParseLatitude xmlns:ns1="urn:us:gov:ic:ism:v2" xmlns:ns3="mil:nga:coordinate_parse"><security ns1:ownerProducer="USA" ns1:classification="U"/><latitude>543423.123S</latitude></ns3:ParseLatitude></S:Body></S:Envelope>